index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Aldric Giacomoni)"/>
<link rel="stylesheet" href="./reveal.js-3.8.0/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js-3.8.0/css/theme/solarized.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">

<section>
<section id="slide-org247b598">
<h2 id="org247b598">Elixir!</h2>
</section>
</section>
<section>
<section id="slide-org0b1042b">
<h2 id="org0b1042b">Fundamentals</h2>
<div class="outline-text-2" id="text-org0b1042b">
</div>
</section>
<section id="slide-org9222871">
<h3 id="org9222871">Functional</h3>
<ul>
<li>Lists, <b>not</b> Arrays!</li>
<li>Immutability</li>

</ul>
</section>
<section id="slide-org55395c5">
<h3 id="org55395c5">Functional</h3>
<div class="org-src-container">

<pre  class="src src-elixir"><code trim><span style="color: #a0522d;">a</span> = [1,2,3]
<span style="color: #a0522d;">a</span> = [0 | a] <span style="color: #b22222;"># </span><span style="color: #b22222;">=&gt; [0,1,2,3]</span>
<span style="color: #a0522d;">b</span> = %{<span style="color: #27408b;">intro:</span> 1, <span style="color: #27408b;">elixir:</span> 2}
</code></pre>
</div>
</section>
<section id="slide-org46a451a">
<h3 id="org46a451a">Functional</h3>
<div class="org-src-container">

<pre  class="src src-elixir"><code trim><span style="color: #a0522d;">a</span> = [1,2,3,4]
<span style="color: #228b22;">Enum</span>.member?(a, 2) <span style="color: #b22222;"># </span><span style="color: #b22222;">=&gt; true</span>
<span style="color: #228b22;">Enum</span>.map(a, <span style="color: #a020f0;">fn</span>(x) -&gt; x + 1 <span style="color: #a020f0;">end</span>) <span style="color: #b22222;"># </span><span style="color: #b22222;">=&gt; [2,3,4,5]</span>
<span style="color: #228b22;">Enum</span>.map(a, &amp;(&amp;1+1)) <span style="color: #b22222;"># </span><span style="color: #b22222;">=&gt; same</span>
</code></pre>
</div>
<p>
Note: this does NOT modify <code>a</code>!
</p>
</section>
<section id="slide-org833a661">
<h3 id="org833a661">Actor pattern</h3>
<p>
Fully segregated Erlang processes:
</p>
<ul>
<li>State isn't shared</li>
<li>easy to make distributed systems</li>

</ul>
</section>
<section id="slide-org27e764c">
<h3 id="org27e764c">Actor Pattern</h3>
<div class="org-src-container">

<pre  class="src src-elixir"><code trim><span style="color: #a020f0;">defmodule</span> <span style="color: #228b22;">MyServer</span> <span style="color: #a020f0;">do</span>
  <span style="color: #a020f0;">use</span> <span style="color: #228b22;">GenServer</span>
<span style="color: #a020f0;">end</span>

{<span style="color: #27408b;">:ok</span>, server} = <span style="color: #228b22;">GenServer</span>.start_link(<span style="color: #228b22;">MyServer</span>, <span style="color: #27408b;">nil</span>)
</code></pre>
</div>
</section>
<section id="slide-orgb42cc97">
<h3 id="orgb42cc97">Supervision tree</h3>
<div class="org-src-container">

<pre  class="src src-elixir"><code trim><span style="color: #a020f0;">defmodule</span> <span style="color: #228b22;">Ecstatic.Supervisor</span> <span style="color: #a020f0;">do</span>
  <span style="color: #a020f0;">use</span> <span style="color: #228b22;">Supervisor</span>
  <span style="color: #b22222;"># </span><span style="color: #b22222;">[...]</span>
  <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">init</span>(<span style="color: #424242;">_arg</span>) <span style="color: #a020f0;">do</span>
    <span style="color: #a0522d;">children</span> = [
      {<span style="color: #228b22;">Ecstatic.Store.Ets</span>, []},
      {<span style="color: #228b22;">Ecstatic.EventSource</span>, []},
      {<span style="color: #228b22;">Ecstatic.EventProducer</span>, []}
    ]

    <span style="color: #228b22;">Supervisor</span>.init(children, <span style="color: #27408b;">strategy:</span> <span style="color: #27408b;">:one_for_one</span>)
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgc4d9b4d">
<h2 id="orgc4d9b4d">Cool things</h2>
<div class="outline-text-2" id="text-orgc4d9b4d">
</div>
</section>
<section id="slide-org43736b5">
<h3 id="org43736b5">Project management tool</h3>
<p>
<code>mix</code> (see more during demo)
</p>
</section>
<section id="slide-org8dbfbc2">
<h3 id="org8dbfbc2">Tests and Documentation</h3>
<p>
Community inherited this from Ruby
</p>
</section>
<section id="slide-org9b1cabc">
<h3 id="org9b1cabc">The pipe operator</h3>
<div class="org-src-container">

<pre  class="src src-elixir"><code trim><span style="color: #a020f0;">require</span> <span style="color: #228b22;">Integer</span>

<span style="color: #a0522d;">a</span> = [1,2,3,4]
<span style="color: #228b22;">Enum</span>.flat_map(a, <span style="color: #a020f0;">fn</span>(x) -&gt; [x,x+1] <span style="color: #a020f0;">end</span>)
|&gt; <span style="color: #228b22;">Enum</span>.filter(<span style="color: #a020f0;">fn</span>(x) -&gt; <span style="color: #228b22;">Integer</span>.is_even(x) <span style="color: #a020f0;">end</span>)
|&gt; <span style="color: #228b22;">Enum</span>.map(<span style="color: #a020f0;">fn</span>(x) -&gt; x - 1 <span style="color: #a020f0;">end</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">=&gt; [1,1,3,3]</span>
</code></pre>
</div>
</section>
</section>
</div>
</div>
<script src="./reveal.js-3.8.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './reveal.js-3.8.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: './reveal.js-3.8.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js-3.8.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js-3.8.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: './reveal.js-3.8.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
